In [1]:
print('hello world')

hello world

In [2]:
import numpy as np
import pandas as pd

In [3]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [4]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [5]:
pd.Series(data=labels,index=my_data)

10    a
20    b
30    c
dtype: object

In [6]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(labels,my_data)

10    a
20    b
30    c
dtype: object

In [8]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [9]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [10]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [12]:
pd.Series(data=[print,sum,len])

0    <built-in function print>
1      <built-in function sum>
2      <built-in function len>
dtype: object

In [16]:
ser1=pd.Series(data=[1,2,3,4],index=['ola','john','sola','ajayi'])

In [17]:
ser1

ola      1
john     2
sola     3
ajayi    4
dtype: int64

In [18]:
ser2 = pd.Series(data=[1,2,5,4],index=['ola','john','thomas','esther'])

In [19]:
ser2

ola       1
john      2
thomas    5
esther    4
dtype: int64

In [20]:
ser1['ola']

1

In [21]:
ser1['john']

2

In [22]:
ser2['thomas']

5

In [23]:
ser3=pd.Series(data=labels)

In [24]:
ser3

0    a
1    b
2    c
dtype: object

In [25]:
ser1 + ser2

ajayi     NaN
esther    NaN
john      4.0
ola       2.0
sola      NaN
thomas    NaN
dtype: float64

#

In [26]:
import numpy as np
import pandas as pd

In [27]:
from numpy.random import randn

In [28]:
np.random.seed(101)

In [30]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [31]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [32]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [34]:
df['X']

A    1.693723
B    0.390528
C    0.072960
D   -0.754070
E    1.901755
Name: X, dtype: float64

In [35]:
df['Y']

A   -1.706086
B    0.166905
C    0.638787
D   -0.943406
E    0.238127
Name: Y, dtype: float64

In [36]:
df['Z']

A   -1.159119
B    0.184502
C    0.329646
D    0.484752
E    1.996652
Name: Z, dtype: float64

In [37]:
type(df)

pandas.core.frame.DataFrame

In [38]:
type(df['Z'])

pandas.core.series.Series

In [39]:
df.W

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [40]:
df.X

A    1.693723
B    0.390528
C    0.072960
D   -0.754070
E    1.901755
Name: X, dtype: float64

In [41]:
df[['W','X']]

          W         X
A  0.302665  1.693723
B -0.134841  0.390528
C  0.807706  0.072960
D -0.497104 -0.754070
E -0.116773  1.901755

In [42]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [43]:
df['NEW'] = df['W'] + df['Y']

In [44]:
df

          W         X         Y         Z       NEW
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [46]:
df.drop('NEW',axis=1)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [47]:
df

          W         X         Y         Z       NEW
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [48]:
df.drop('NEW',axis=1,inplace=True)

In [49]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [50]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [51]:
df.drop('A')

          W         X         Y         Z
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [52]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [53]:
df.shape

(5, 4)

In [54]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [55]:
df[['W','X']]

          W         X
A  0.302665  1.693723
B -0.134841  0.390528
C  0.807706  0.072960
D -0.497104 -0.754070
E -0.116773  1.901755

In [56]:
# SELECTING ROWS IN DATAFRAMES

In [57]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [58]:
df.iloc[0]

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [59]:
df.loc['A']

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [60]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [61]:
# combining index and column

In [63]:
df.loc[['A','B'],['W','X']]

          W         X
A  0.302665  1.693723
B -0.134841  0.390528

In [64]:
import numpy as np
import pandas as pd

In [65]:
from numpy.random import randn

In [66]:
np.random.seed(101)

In [67]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [68]:
df>0

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [69]:
booldf = df>0

In [70]:
booldf

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [71]:
df[booldf]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [72]:
df[df>0]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [73]:
df['W'] > 0

A     True
B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [74]:
df[df['W']>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [75]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [76]:
resultdf = df[df['W']>0]

In [77]:
resultdf

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [78]:
resultdf['X']

A    1.693723
C    0.072960
Name: X, dtype: float64

In [85]:
df[df['W']>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [86]:
df[df['W']>0]['X']

A    1.693723
C    0.072960
Name: X, dtype: float64

In [88]:
df[df['W']>0][['X','Y']]

          X         Y
A  1.693723 -1.706086
C  0.072960  0.638787

In [89]:
boolser = df['W'] > 0
result = df[boolser]
mycols = ['Y','X']
result[mycols]

          Y         X
A -1.706086  1.693723
C  0.638787  0.072960

In [90]:
df[(df['W']>0)|(df['Y']>1)]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [91]:
df[(df['W']>0)&(df['Y']>1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [92]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [93]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [94]:
newind = 'CA NY WY OR CO'.split()

In [95]:
'CA NY WY OR CO'.split()

['CA', 'NY', 'WY', 'OR', 'CO']

In [96]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [97]:
df['states'] = newind

In [98]:
df

          W         X         Y         Z states
A  0.302665  1.693723 -1.706086 -1.159119     CA
B -0.134841  0.390528  0.166905  0.184502     NY
C  0.807706  0.072960  0.638787  0.329646     WY
D -0.497104 -0.754070 -0.943406  0.484752     OR
E -0.116773  1.901755  0.238127  1.996652     CO

In [99]:
df.set_index('states')

               W         X         Y         Z
states
CA      0.302665  1.693723 -1.706086 -1.159119
NY     -0.134841  0.390528  0.166905  0.184502
WY      0.807706  0.072960  0.638787  0.329646
OR     -0.497104 -0.754070 -0.943406  0.484752
CO     -0.116773  1.901755  0.238127  1.996652

In [101]:
#pandas 
#DataFrames Part3

In [102]:
import numpy as np
import pandas as pd

In [103]:
#index levels
outside = ['G1','G1','G1','G2','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [104]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2', 'G2']

In [105]:
inside

[1, 2, 3, 1, 2, 3]

In [106]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [107]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [108]:
df

             A         B
G1 1  2.706850  0.628133
   2  0.907969  0.503826
   3  0.651118 -0.319318
G2 1 -0.848077  0.605965
   2 -2.018168  0.740122
   3  0.528813 -0.589001

In [109]:
df.loc['G1']

          A         B
1  2.706850  0.628133
2  0.907969  0.503826
3  0.651118 -0.319318

In [110]:
df.iloc[0]

A    2.706850
B    0.628133
Name: (G1, 1), dtype: float64

In [111]:
df.loc['G1'].loc[1]

A    2.706850
B    0.628133
Name: 1, dtype: float64

In [112]:
df

             A         B
G1 1  2.706850  0.628133
   2  0.907969  0.503826
   3  0.651118 -0.319318
G2 1 -0.848077  0.605965
   2 -2.018168  0.740122
   3  0.528813 -0.589001

In [115]:
df.index.names

FrozenList([None, None])

In [116]:
df.index.names= ['Groups','num']

In [117]:
df

                   A         B
Groups num
G1     1    2.706850  0.628133
       2    0.907969  0.503826
       3    0.651118 -0.319318
G2     1   -0.848077  0.605965
       2   -2.018168  0.740122
       3    0.528813 -0.589001

In [118]:
df.loc['G2'].loc[2]['B']

0.7401220570561068

In [119]:
df.loc['G1'].loc[1]['A']

2.706849839399938

In [120]:
df

                   A         B
Groups num
G1     1    2.706850  0.628133
       2    0.907969  0.503826
       3    0.651118 -0.319318
G2     1   -0.848077  0.605965
       2   -2.018168  0.740122
       3    0.528813 -0.589001

In [121]:
df.loc['G1']

            A         B
num
1    2.706850  0.628133
2    0.907969  0.503826
3    0.651118 -0.319318

In [122]:
df.xs('G1')

            A         B
num
1    2.706850  0.628133
2    0.907969  0.503826
3    0.651118 -0.319318

In [123]:
df.xs('G2')

            A         B
num
1   -0.848077  0.605965
2   -2.018168  0.740122
3    0.528813 -0.589001

In [125]:
df.xs(1,level='num')

               A         B
Groups
G1      2.706850  0.628133
G2     -0.848077  0.605965

In [126]:
# missing data

In [130]:
import numpy as np
import pandas as pd

In [131]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [132]:
df = pd.DataFrame(d)

In [133]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [134]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [135]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [140]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [141]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [142]:
df.fillna(value='rich guy')

          A         B  C
0       1.0       5.0  1
1       2.0  rich guy  2
2  rich guy  rich guy  3

In [143]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [144]:
### Groupby

In [145]:
data = {'company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'person':['sam','charlie','Amy','Vanessa','Carl','Sarah'],
         'Sales':[200,120,340,124,243,350]}

In [147]:
df = pd.DataFrame(data)

In [148]:
df

  company   person  Sales
0    GOOG      sam    200
1    GOOG  charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [149]:
df.groupby('company')

In [150]:
bycomp = df.groupby('company')

In [151]:
bycomp.mean()

         Sales
company
FB       296.5
GOOG     160.0
MSFT     232.0

In [152]:
df

  company   person  Sales
0    GOOG      sam    200
1    GOOG  charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [153]:
bycomp.std()

              Sales
company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [156]:
bycomp.min()

          person  Sales
company
FB          Carl    243
GOOG     charlie    120
MSFT         Amy    124

In [158]:
pg=df.groupby('person')

In [159]:
pg.min()

        company  Sales
person
Amy        MSFT    340
Carl         FB    243
Sarah        FB    350
Vanessa    MSFT    124
charlie    GOOG    120
sam        GOOG    200

In [160]:
bycomp.sum()

         Sales
company
FB         593
GOOG       320
MSFT       464

In [161]:
df

  company   person  Sales
0    GOOG      sam    200
1    GOOG  charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [162]:
bycomp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [163]:
df.groupby('company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [164]:
df.groupby('company').count()

         person  Sales
company
FB            2      2
GOOG          2      2
MSFT          2      2

In [165]:
df.groupby('company').max()

          person  Sales
company
FB         Sarah    350
GOOG         sam    200
MSFT     Vanessa    340

In [166]:
df.groupby('company').min()

          person  Sales
company
FB          Carl    243
GOOG     charlie    120
MSFT         Amy    124

In [167]:
df.groupby('company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [169]:
df.groupby('company').describe().transpose()

company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [170]:
# merging joinining and concatenating

In [171]:
import pandas as pd

In [172]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                     'B':['B0','B1','B2','B3'],
                      'C':['D0','D1','D2','D3']},
                      index=[0,1,2,3])

In [173]:
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                     'B':['B4','B5','B6','B7'],
                      'C':['D4','D5','D6','D7']},
                      index=[4,5,6,7])

In [174]:
df3 = pd.DataFrame({'A':['A8','A9','A10','A11'],
                     'B':['B8','B9','B10','B11'],
                      'C':['D8','D9','D10','D11']},
                      index=[8,9,10,11])

In [175]:
df1

    A   B   C
0  A0  B0  D0
1  A1  B1  D1
2  A2  B2  D2
3  A3  B3  D3

In [176]:
df2

    A   B   C
4  A4  B4  D4
5  A5  B5  D5
6  A6  B6  D6
7  A7  B7  D7

In [177]:
df3

      A    B    C
8    A8   B8   D8
9    A9   B9   D9
10  A10  B10  D10
11  A11  B11  D11

In [178]:
pd.concat([df1,df2,df3])

      A    B    C
0    A0   B0   D0
1    A1   B1   D1
2    A2   B2   D2
3    A3   B3   D3
4    A4   B4   D4
5    A5   B5   D5
6    A6   B6   D6
7    A7   B7   D7
8    A8   B8   D8
9    A9   B9   D9
10  A10  B10  D10
11  A11  B11  D11

In [180]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    A    B    C    A    B    C
0    A0   B0   D0  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   D1  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   D2  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   D3  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN   A4   B4   D4  NaN  NaN  NaN
5   NaN  NaN  NaN   A5   B5   D5  NaN  NaN  NaN
6   NaN  NaN  NaN   A6   B6   D6  NaN  NaN  NaN
7   NaN  NaN  NaN   A7   B7   D7  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  D11

In [181]:
left = pd.DataFrame({'key':['K0','K1','K2','K3'],
                     'A':['A0','A1','A2','A3'],
                      'B':['B0','B1','B2','B3']})
right = pd.DataFrame({'key':['k0','k1','k2','k3'],
                      'C':['C0','C1','C2','C3'],
                       'D':['D0','D1','D2','D3']})

In [182]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [183]:
right

  key   C   D
0  k0  C0  D0
1  k1  C1  D1
2  k2  C2  D2
3  k3  C3  D3

In [1]:
#pd.merge(left,right,how='inner',on='key')